---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCFileFormat
source: html/8cc5d062-6b70-66c0-1ef6-4f2fdd084a61.htm
---
# Autodesk.Revit.DB.IFC.IFCFileFormat

The IFC file format.

## Syntax (C#)
```csharp
public enum IFCFileFormat
```